InformationRegisters/РезультатыКруговогоОсмотра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>РезультатыКруговогоОсмотра</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗвуковойСигнал</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтояночныйТормоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РемниБезопасности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтопительКондиционер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтеклоочистителиОмыватели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньТоплива</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешниеОсветительныеПриборы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВоздушныйФильтрДвигателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УровеньМаслаВДвигателе</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриводныеРемни</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Трубопроводы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КлеммыАКБ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РулевоеУправление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодшипникиСтупицПередних</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодшипникиСтупицЗадних</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Амортизаторы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТормозныеДискиПередние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТормозныеДискиЗадние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТормозныеКолодкиПередние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТормозныеКолодкиЗадние</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КолесныеДискиКолпакиШины</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеСотРадиатора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШРУСыИПыльники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПередняяПодвеска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗадняяПодвеска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СистемаВыпуска</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГерметичностьОтстутствиеПодтеканий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗапасноеКолесо</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ШтатныйНаборИнструментов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Домкрат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДорожныйНабор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Аптечка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пепельница</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прикуриватель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОхранныеСистемыСБлокировкойЗапускаДвигателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СекретныеГайкиНаКолесах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кузов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрочиеЗамечания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоврежденияКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаНаименование1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаНаименование2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаНаименование3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаНаименование4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаКоличество1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаКоличество2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаКоличество3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДетальЗаказчикаКоличество4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтруктураОтметок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРемонт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказНаряд</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НазванияПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>НазванияПечатныхФорм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПредварительныйЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РабочийЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФинальныйЗН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АктПриемаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодборочныйЛистНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласиеНаОбработкуПерсональныхДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДанныхПоНазначеннымСобытиям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФотографий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыСобытий</Name>
			<Comment>Виды событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анкетирование</Name>
					<Comment>Вид события анкетирования</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаАвтомобиля</Name>
					<Comment>Вид события выдачи автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаменаАвтомобиля</Name>
					<Comment>Вид события замены автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛичнаяВстреча</Name>
					<Comment>Личная встреча</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтказОтАвтомобиля</Name>
					<Comment>Вид события отказа от автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереуступкаАвтомобиля</Name>
					<Comment>Вид события переуступки автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПочтовоеПисьмо</Name>
					<Comment>Почтовое письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочее</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Comment>Телефонный звонок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТестДрайв</Name>
					<Comment>Тест-драйв автомобиля</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронноеПисьмо</Name>
					<Comment>Электронное письмо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SMS</Name>
					<Comment>SMS событие</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВежливости</Name>
					<Comment>Звонок вежливости клиенту</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявкаССайта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тендер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БачатаАвто</Name>
					<Comment>Событие агрегатора Бачата Авто</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОАБР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ООАБР</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ФормыСобственности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ФормыСобственности</Name>
			<Comment>Варианты форм собственности контрагентов</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Comment>Любая форма юридического лица</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастныйПредприниматель</Name>
					<Comment>Частный предприниматель</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастноеЛицо</Name>
					<Comment>Частное лицо</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбособленноеПодразделение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Прочий вид собственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПолФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ПолФизическихЛиц</Name>
			<Comment>Пол физических лиц</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеУказан</Name>
					<Comment>Пол не указан</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
					<Comment>Пол мужской</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
					<Comment>Пол женский</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/Print/Ext/Module.bsl
Функция Print(PrintRequest)
	PrintType = ФабрикаXDTO.Тип("http://wa.dms.webservice/PrintRequest", "PrintResponse");
	Print = ФабрикаXDTO.Создать(PrintType);   
	
	ТаблицаОщибок = Новый ТаблицаЗначений;
	ТаблицаОщибок.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка"));
	ТаблицаОщибок.Колонки.Добавить("ТекстОшибки", Новый ОписаниеТипов("Строка"));
	
    Попытка
		НомерЗаказНаряда = PrintRequest.Print.DMSRONo;
	Исключение
		НомерЗаказНаряда = "";	 
	КонецПопытки; 
	
	Попытка
		IDЗаказНаряда = PrintRequest.Print.DMSROID;
	Исключение
		IDЗаказНаряда = "";	 
	КонецПопытки; 
	
	ЗаказНарядСсылка = Документы.ЗаказНаряд.ПустаяСсылка();
	Если ЗначениеЗаполнено(IDЗаказНаряда) Тогда
		Попытка
			ID = Новый УникальныйИдентификатор(IDЗаказНаряда);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PR01";
			НоваяСтрока.ТекстОшибки = "Неверный параметр идентификатор заказ-наряда";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print;   	
		КонецПопытки;
		ЗаказНарядСсылка = Документы.ЗаказНаряд.ПолучитьСсылку(ID);
    	Если ЗаказНарядСсылка.ПолучитьОбъект() = Неопределено Тогда		
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PR01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным идентификатором не найден";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print;  		
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(НомерЗаказНаряда) Тогда 
		ЗаказНарядСсылка = Документы.ЗаказНаряд.НайтиПоНомеру(НомерЗаказНаряда, ТекущаяДата());
		Если ЗаказНарядСсылка.Пустая() Тогда  			
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "PR01";
			НоваяСтрока.ТекстОшибки = "Заказ-наряд с указанным номером не найден";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print;  		
		КонецЕсли;
		
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PR01";
		НоваяСтрока.ТекстОшибки = "Не задано ни одного ключевого параметра для печати";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		Возврат Print;   	  
	КонецЕсли;	    

    Попытка
		ВидПечатнойФормы = PrintRequest.Print.PrintType;
	Исключение
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PR02";
		НоваяСтрока.ТекстОшибки = "Не задан вид печатной формы";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest, Print, "-1", ТаблицаОщибок);
		Возврат Print;  
	КонецПопытки;   
	Если ВидПечатнойФормы = "1" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПредварительныйЗН;	
	ИначеЕсли ВидПечатнойФормы = "2" Тогда	
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.РабочийЗН;	
	ИначеЕсли ВидПечатнойФормы = "3" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ФинальныйЗН;		
	ИначеЕсли ВидПечатнойФормы = "4" Тогда		
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.КонтрольКачества;
	ИначеЕсли ВидПечатнойФормы = "5" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.АктПриемаПередачи;
	ИначеЕсли ВидПечатнойФормы = "6" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПодборочныйЛистНаСклад;
	ИначеЕсли ВидПечатнойФормы = "7" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.СогласиеНаОбработкуПерсональныхДанных;
	ИначеЕсли ВидПечатнойФормы = "8" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаДанныхПоНазначеннымСобытиям;
	ИначеЕсли ВидПечатнойФормы = "9" Тогда
		ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаФотографий;
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "PR02";
		НоваяСтрока.ТекстОшибки = "Неверный вид печатной формы";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest, Print, "-1", ТаблицаОщибок);
		Возврат Print;  		
	КонецЕсли;
	
	Попытка
		КоличествоЭкземпляров = PrintRequest.Print.CopyNumber;
	Исключение
    	КоличествоЭкземпляров = "1";
	КонецПопытки;    
	
	Попытка
		КодСотрудника = PrintRequest.TransactionHeader.RequestPollingToken;
	Исключение
		КодСотрудника = "";
	КонецПопытки; 
	Если ЗначениеЗаполнено(КодСотрудника) Тогда
		Сотрудник = Справочники.Сотрудники.НайтиПоКоду(КодСотрудника);
		Если Сотрудник.Пустая() Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Задан неверный код сотрудника (RequestPollingToken)!";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest,Print, "-1", ТаблицаОщибок);
			Возврат Print; 					
		КонецЕсли;
	Иначе
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не задан код сотрудника (RequestPollingToken)!";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest,Print, "-1", ТаблицаОщибок);
		Возврат Print; 					
	КонецЕсли;
	
	Попытка
		VHC = PrintRequest.Print.VHC;
	Исключение
    	VHC = Неопределено;       		
	КонецПопытки;  
	
	Если VHC <> Неопределено Тогда
		ЗаписьКруговогоОсмотра = РегистрыСведений.РезультатыКруговогоОсмотра.СоздатьМенеджерЗаписи();
		ЗаписьКруговогоОсмотра.ЗаказНаряд = ЗаказНарядСсылка;
		ДокументОснование = ЗаказНарядСсылка.ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ЗаявкаНаРемонтСсылка = ДокументОснование;
		Иначе
			ЗаявкаНаРемонтСсылка = Документы.ЗаявкаНаРемонт.ПустаяСсылка();
		КонецЕсли;
		ЗаписьКруговогоОсмотра.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
		ЗаписьКруговогоОсмотра.Прочитать();
		Если Не ЗаписьКруговогоОсмотра.Выбран() Тогда
			ЗаписьКруговогоОсмотра.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
			ЗаписьКруговогоОсмотра.ЗаказНаряд = ЗаказНарядСсылка;
		КонецЕсли;
		
		Попытка
			ЗаписьКруговогоОсмотра.ЗвуковойСигнал = ?(PrintRequest.Print.VHC.InternalInspection.Horn="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = "n";       		
		КонецПопытки;  
        Попытка
			ЗаписьКруговогоОсмотра.СтояночныйТормоз = ?(PrintRequest.Print.VHC.InternalInspection.ParkingBrake="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
	    Попытка
			ЗаписьКруговогоОсмотра.РемниБезопасности = ?(PrintRequest.Print.VHC.InternalInspection.SafetyBelts="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
        Попытка
			ЗаписьКруговогоОсмотра.ОтопительКондиционер = ?(PrintRequest.Print.VHC.InternalInspection.ConditionSystem="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.СтеклоочистителиОмыватели = ?(PrintRequest.Print.VHC.InternalInspection.WipersWashers="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;  		
		Попытка
			ЗаписьКруговогоОсмотра.УровеньТоплива = PrintRequest.Print.VHC.LevelOfFuelInTank.Value;
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";   			
		КонецПопытки;  		
        Попытка
			ЗаписьКруговогоОсмотра.ВнешниеОсветительныеПриборы = ?(PrintRequest.Print.VHC.ExternalInspection.ExternalLights="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		
        Попытка
			ЗаписьКруговогоОсмотра.ВоздушныйФильтрДвигателя = ?(PrintRequest.Print.VHC.UnderhoodInspection.AirFilter="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
        Попытка
			ЗаписьКруговогоОсмотра.УровеньМаслаВДвигателе = PrintRequest.Print.VHC.UnderhoodInspection.OilLevelInEngine;
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ПриводныеРемни = ?(PrintRequest.Print.VHC.UnderhoodInspection.DriveBelts="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;    
		Попытка
			ЗаписьКруговогоОсмотра.Трубопроводы = ?(PrintRequest.Print.VHC.UnderhoodInspection.PipelinesLeakage="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.КлеммыАКБ = ?(PrintRequest.Print.VHC.UnderhoodInspection.Battery="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;         	
				
		
		Попытка
			ЗаписьКруговогоОсмотра.РулевоеУправление = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.SteeringSystem="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ПодшипникиСтупицПередних = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.FrontWheelBearings="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ПодшипникиСтупицЗадних = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.RearWheelBearings="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;    
		Попытка
			ЗаписьКруговогоОсмотра.Амортизаторы = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.ShockAbsorbers="g",Истина,Ложь);  
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ТормозныеДискиПередние = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.FrontBrakeDiscs="g",Истина,Ложь);  
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки; 
		Попытка
			ЗаписьКруговогоОсмотра.ТормозныеДискиЗадние = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.RearBrakeDiscs="g",Истина,Ложь);     
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ТормозныеКолодкиПередние = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.FrontBrakePads="g",Истина,Ложь);     
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ТормозныеКолодкиЗадние = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.RearBrakePads="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;    
		Попытка
			ЗаписьКруговогоОсмотра.КолесныеДискиКолпакиШины = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.TyresWheelDiscs="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.СостояниеСотРадиатора = ?(PrintRequest.Print.VHC.VehicleIsPartlyLifted.Radiators="g",Истина,Ложь);   
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;      
					
		Попытка
			ЗаписьКруговогоОсмотра.ШРУСыИПыльники = ?(PrintRequest.Print.VHC.VehicleIsFullyLifted.DriveShafts="g",Истина,Ложь);  
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ПередняяПодвеска = ?(PrintRequest.Print.VHC.VehicleIsFullyLifted.FrontSuspension="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ЗадняяПодвеска = ?(PrintRequest.Print.VHC.VehicleIsFullyLifted.RearSuspension="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;    
		Попытка
			ЗаписьКруговогоОсмотра.СистемаВыпуска = ?(PrintRequest.Print.VHC.VehicleIsFullyLifted.ExhaustSystem="g",Истина,Ложь);  
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.ГерметичностьОтстутствиеПодтеканий = ?(PrintRequest.Print.VHC.VehicleIsFullyLifted.LeakageOfTechnicalLiquids="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки; 
		
		Попытка
			ЗаписьКруговогоОсмотра.ПоврежденияКузова = PrintRequest.Print.VHC.InspectionOfBodyAndWindows.Value;
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки; 
		
        Попытка
			ЗаписьКруговогоОсмотра.ЗапасноеКолесо = ?(PrintRequest.Print.VHC.Complectation.AdditionalWheel="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
        Попытка
			ЗаписьКруговогоОсмотра.ШтатныйНаборИнструментов = ?(PrintRequest.Print.VHC.Complectation.StandardToolkit="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.Домкрат = ?(PrintRequest.Print.VHC.Complectation.Jack="g",Истина,Ложь);    
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;    
		Попытка
			ЗаписьКруговогоОсмотра.ДорожныйНабор = ?(PrintRequest.Print.VHC.Complectation.Roadkit="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.Аптечка = ?(PrintRequest.Print.VHC.Complectation.FirstAidkit="g",Истина,Ложь); 
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки; 
		Попытка
			ЗаписьКруговогоОсмотра.Пепельница = ?(PrintRequest.Print.VHC.Complectation.Ashtray="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.Прикуриватель = ?(PrintRequest.Print.VHC.Complectation.CigaretteLighter="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки; 

        Попытка
			ЗаписьКруговогоОсмотра.ОхранныеСистемыСБлокировкойЗапускаДвигателя = ?(PrintRequest.Print.VHC.AdditionalEquipment.SecuritySystemWithEngineImmobilizer="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";       		
		КонецПопытки;  
		Попытка
			ЗаписьКруговогоОсмотра.СекретныеГайкиНаКолесах = ?(PrintRequest.Print.VHC.AdditionalEquipment.SecretNutsOnWheels="g",Истина,Ложь);
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;	
		
		Попытка
			ЗаписьКруговогоОсмотра.ПрочиеЗамечания = PrintRequest.Print.VHC.Comment.GeneralComment;
		Исключение
			//СтрокаОтметок = СтрокаОтметок + ";" + "n";    		
		КонецПопытки;	
		
		ЗаписьКруговогоОсмотра.Сотрудник = Сотрудник;   
		ЗаписьКруговогоОсмотра.Дата = ТекущаяДата(); 
		
		Попытка
			МассивТоваров = PrintRequest.Print.VHC.CustomerSpareParts; 
			сч=1;
			Для Каждого Товар Из МассивТоваров.CustomerSparePart Цикл
				Если сч=1 Тогда
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаНаименование1 = Товар.Name;
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаКоличество1 = Товар.Quantity; 
				ИначеЕсли сч=2 Тогда
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаНаименование2 = Товар.Name;
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаКоличество2 = Товар.Quantity; 
				ИначеЕсли сч=3 Тогда
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаНаименование3 = Товар.Name;
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаКоличество3 = Товар.Quantity; 
				ИначеЕсли сч=4 Тогда
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаНаименование4 = Товар.Name;
					ЗаписьКруговогоОсмотра.ДетальЗаказчикаКоличество4 = Товар.Quantity;
				КонецЕсли;
				сч=сч+1;
			КонецЦикла; 
		Исключение
		КонецПопытки;

		ЗаписьКруговогоОсмотра.Записать();
		
		Попытка
			МассивФотографий = PrintRequest.Print.VHC.Photos; 
			сч=1;
			Для Каждого Фото Из МассивФотографий.Photo Цикл
				РегКартинкиИФайлы = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
				РегКартинкиИФайлы.Объект = ЗаказНарядСсылка;
				РегКартинкиИФайлы.Идентификатор = Фото.Category+"_"+Строка(сч);
				РегКартинкиИФайлы.ИмяФайла = Фото.Value;
				РегКартинкиИФайлы.ДатаСохранения = ТекущаяДата();
				РегКартинкиИФайлы.Комментарий = "Фотографии из планшета WA";
				РегКартинкиИФайлы.ДанныеВоВнешнемФайле = Истина;
				РегКартинкиИФайлы.Картинка = Истина;
				РегКартинкиИФайлы.Записать(Истина);  
				сч=сч+1;
			КонецЦикла;
        Исключение
		КонецПопытки;      		
	КонецЕсли;
	
	Попытка
		FinalInspection = PrintRequest.Print.FinalInspection;
	Исключение
    	FinalInspection = Неопределено;       		
	КонецПопытки;  
	
	Если FinalInspection <> Неопределено Тогда		
		ЗаписьКруговогоОсмотра = РегистрыСведений.РезультатыКруговогоОсмотра.СоздатьМенеджерЗаписи();
		ЗаписьКруговогоОсмотра.ЗаказНаряд = ЗаказНарядСсылка;
		ДокументОснование = ЗаказНарядСсылка.ДокументОснование;
		Если ЗначениеЗаполнено(ДокументОснование) И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаявкаНаРемонт") Тогда
			ЗаявкаНаРемонтСсылка = ДокументОснование;
		Иначе
			ЗаявкаНаРемонтСсылка = Документы.ЗаявкаНаРемонт.ПустаяСсылка();
		КонецЕсли;
		ЗаписьКруговогоОсмотра.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
		ЗаписьКруговогоОсмотра.Прочитать();
		Если Не ЗаписьКруговогоОсмотра.Выбран() Тогда
			ЗаписьКруговогоОсмотра.ЗаявкаНаРемонт = ЗаявкаНаРемонтСсылка;
			ЗаписьКруговогоОсмотра.ЗаказНаряд = ЗаказНарядСсылка;
		КонецЕсли;	
		СтрокаОтметок = "";
		
		// PreparingForFinalInspection - Подготовка к контролю качества
		Попытка
			СтрокаОтметок = PrintRequest.Print.FinalInspection.PreparingForFinalInspection.LookThrowTheWorkingDocumentation;
		Исключение
	    	СтрокаОтметок = "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.PreparingForFinalInspection.LookThrowTheHistoryOfService;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		//Попытка
		//	СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.PreparingForFinalInspection.PreparingGenericComment;
		//Исключение
		//	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		//КонецПопытки;  
		
		// InspectionUnderTheVehicle - Проверка под автомобилем
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.InspectionUnderTheVehicle.AbsenseOfLeakage;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.InspectionUnderTheVehicle.BrakeAndFuelPipesAndHoses;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.InspectionUnderTheVehicle.CrankcaseProtection;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.InspectionUnderTheVehicle.TighteningTorqueOfDrainPlugsAndBrakeCalipers;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + СокрЛП(PrintRequest.Print.FinalInspection.InspectionUnderTheVehicle.InspectionUnderGenericComment);
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + "; "; // это Комментарий1       		
		КонецПопытки; 
		
		// CheckInsideOutside - Проверка внутри/снаружи
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.DamagesOnBodyAndPaint;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.ExteriorLighting;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.WiperAndWasherNozzles;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.HornHandbrakeAndSeatBelts;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.SettingsOfClockAndMediaSystem;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.AbsenceOfCautionIndicatorsOnTheDashboard;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.DoorsLocksAndWindowLifts;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.TighteningTorqueOfWheelNuts;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.CheckInsideOutside.AirPressureInTheTiresAndSpareWheel;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + СокрЛП(PrintRequest.Print.FinalInspection.CheckInsideOutside.CheckInOutGenericComment);
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + "; "; // это Комментарий2       		
		КонецПопытки;  

		// UnderHoodInspection - Проверка под капотом
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.CleanlinessOfEngine;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.AbsenceOfLeakage;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.TighteningTorqueOfOilFillerCapsAndRadiator;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.CleanlinessAndTighteningOfBatteryTerminals;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.LevelsOfTechnicalLiquids;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.ExistenceOfSpecialTag;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.UnderHoodInspection.CheckingOfCorrectnessOfHeadlights;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + СокрЛП(PrintRequest.Print.FinalInspection.UnderHoodInspection.UnderhoodInspecGenericComment);
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + "; "; // это Комментарий3       		
		КонецПопытки;  

		// RoadTest - Дорожные испытания (в случае необходимости)
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.RoadTest.CorrectnessOfEngineWorks;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.RoadTest.CorrectnessWorkingOfClutchAndTransmission;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.RoadTest.TheCorrectPositionOfTheSteeringWheel;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.RoadTest.LackOfNoiseVibrationAndDynamicImpact;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + СокрЛП(PrintRequest.Print.FinalInspection.RoadTest.RoadGenericComment);
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + "; "; // это Комментарий4       		
		КонецПопытки;  
		
		// StandTest - Испытания на стенде (в случае необходимости)
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.StandTest.Brakes;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.StandTest.Shocks;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.StandTest.CorrectnessWayOfCarMoving;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + СокрЛП(PrintRequest.Print.FinalInspection.StandTest.StendGenericComment);
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + "; "; // это Комментарий5       		
		КонецПопытки;  

		// Summary - Подведение итогов
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.CompletedWorkConsistentWithTheStated;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.ReplacedPartsMatchesWithWorkDoneAndPackedProperly;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.TheVehicleIsSuitableForUse;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.FillInFinalInspectionListAndSign;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
        Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.CleanCarInsideAndOut;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;  
		Попытка
			СтрокаОтметок = СтрокаОтметок + ";" + PrintRequest.Print.FinalInspection.Summary.ToSignRepairOrderAndGiveItSA;
		Исключение
	    	СтрокаОтметок = СтрокаОтметок + ";" + "0";       		
		КонецПопытки;
		
		ЗаписьКруговогоОсмотра.СтруктураОтметок = СтрокаОтметок;
		ЗаписьКруговогоОсмотра.Записать();
	КонецЕсли;  
	
	////////////////// временное отключение печати
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////	
    Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"1",ТаблицаОщибок);
	Возврат Print;
	//////////////////////////////////////////////////////////////////////////////////////////////////////////////
	
	Если ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.АктПриемаПередачи Тогда // акт приема-передачи
		//Если обЗначениеНеЗаполнено(ЗаказНарядСсылка.Заказчик.ДатаКонтакта) Тогда
		//	НоваяСтрока = ТаблицаОщибок.Добавить();
		//	НоваяСтрока.Код = "WA03";
		//	НоваяСтрока.ТекстОшибки = "Печать акта без указания времени послесервисного контакта запрещена";
		//	Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		//	Возврат Print;    
		//КонецЕсли;  
		
		//Если ЗаказНарядСсылка.Заказчик.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.Да ИЛИ ЗаказНарядСсылка.Заказчик.СогласиеНаОбработкуПерсональныхДанных = Перечисления.ВариантыОтветов.нет Тогда
		//Иначе  			
		//	НоваяСтрока = ТаблицаОщибок.Добавить();
		//	НоваяСтрока.Код = "WA03";
		//	НоваяСтрока.ТекстОшибки = "Печать акта без согласия на обработку ПД запрещена";
		//	Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		//	Возврат Print; 			
		//КонецЕсли; 
	КонецЕсли;
	
	Если ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПредварительныйЗН
			ИЛИ ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.РабочийЗН  Тогда // предварительный заказ-наряд или рабочий заказ-наряд		
		Если обЗначениеНеЗаполнено(ЗаказНарядСсылка.Ожидает) Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Печать заказ-наряда без указания места ожидания клиента запрещена";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest,Print, "-1", ТаблицаОщибок);
			Возврат Print; 		
		КонецЕсли;    
	КонецЕсли;
	
	Если ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ФинальныйЗН И обЗначениеНеЗаполнено(ЗаказНарядСсылка.ДатаОкончания)  Тогда // финальный заказ-наряд
    	НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Печать финального заказ-наряда без даты окончания запрещена";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest,Print, "-1", ТаблицаОщибок);
		Возврат Print; 		
	КонецЕсли; 
		
	Если ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаДанныхПоНазначеннымСобытиям Тогда //передача данных по назначенным событиям      		
		Попытка
			DeclinedJobs = PrintRequest.Print.DeclinedJobs;
		Исключение
	    	DeclinedJobs = Неопределено;       		
		КонецПопытки; 
		
		Если DeclinedJobs <> Неопределено Тогда // запланированные (отложенные) события								
			Для Каждого DeclinedJob Из DeclinedJobs.DeclinedJob Цикл
				Если DeclinedJob.FollowUpDate = Неопределено Тогда // дата следующего контакта с клиентом
					Продолжить;
				КонецЕсли;
				
				НовРЛ = Документы.РабочийЛистСервиса.СоздатьДокумент();	
				НовРЛ.Дата = ТекущаяДата();
				НовРЛ.ХозОперация = Справочники.ХозОперации.РабочийЛистСервиса;
				НовРЛ.Организация = Сотрудник.Организация;
				НовРЛ.ПодразделениеКомпании = Сотрудник.Подразделение;
				НовРл.Автор = Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник", Сотрудник);
				НовРЛ.Менеджер = Сотрудник;
				НовРл.Контрагент = ЗаказНарядСсылка.Контрагент;
				НовРл.ВидКонтакта = Перечисления.ВидыСобытий.ТелефонныйЗвонок;
				НовРЛ.Реклама = ЗаказНарядСсылка.ИсточникИнформации;
				НовРЛ.ЮридическоеЛицо = ЗаказНарядСсылка.Контрагент.ФормаСобственности <> Перечисления.ФормыСобственности.ЧастноеЛицо;
				Если НовРЛ.ЮридическоеЛицо Тогда
					НовРЛ.Пол = Перечисления.ПолФизическихЛиц.Мужской;
				Иначе
					НовРЛ.Пол = ЗаказНарядСсылка.Контрагент.Пол;
				КонецЕсли;
				НовРл.Пользователи.Очистить();
				НовыйПользователь = НовРл.Пользователи.Добавить();
				НовыйПользователь.Пользователь = НовРл.Автор;
				
				Телефон = киПолучитьПредставлениеКИ(ЗаказНарядСсылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактный);
				Если обЗначениеНеЗаполнено(Телефон) Тогда
					Телефон = киПолучитьПредставлениеКИ(ЗаказНарядСсылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонСотовый);
				КонецЕсли;
				Если обЗначениеНеЗаполнено(Телефон) Тогда
					Телефон = киПолучитьПредставлениеКИ(ЗаказНарядСсылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонДомашний);
				КонецЕсли;
				Если обЗначениеНеЗаполнено(Телефон) Тогда
					Телефон = киПолучитьПредставлениеКИ(ЗаказНарядСсылка.Контрагент, Справочники.ВидыКонтактнойИнформации.ТелефонРабочий);
				КонецЕсли;
				Если ЗначениеЗаполнено(Телефон) Тогда
					НовРЛ.ПредставлениеТелефона = Телефон;
				Иначе
					НовРЛ.ПредставлениеТелефона = "<не указан>";
				КонецЕсли;
				
				НовРЛ.Автомобиль = ЗаказНарядСсылка.Автомобиль;
				НовРЛ.Модель = ЗаказНарядСсылка.Автомобиль.Модель;
				НовРЛ.ВариантКомплектации = ЗаказНарядСсылка.Автомобиль.ВариантКомплектации;
				НовРЛ.Цвет = ЗаказНарядСсылка.Автомобиль.Цвет;
				НовРЛ.ПричинаОбращения = "WA: " + DeclinedJob.Name;
				НовРЛ.Комментарий = DeclinedJob.Comment;
		        НовРЛ.Статус = Справочники.СтатусыРабочегоЛиста.Создан;
				Попытка
					НовРЛ.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					НовРЛ.ОбменДанными.Загрузка = Истина;
					НовРЛ.Записать();
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "WA03";
					НоваяСтрока.ТекстОшибки = "Не удалось провести РЛ: " + ОписаниеОшибки();
					Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest", PrintRequest,Print, "-1", ТаблицаОщибок);
					Возврат Print; 					
				КонецПопытки;
				
				Если Не НовРЛ.ЭтоНовый() Тогда
					НовСобытие=Документы.Событие.СоздатьДокумент();
					НовСобытие.ОбработкаЗаполнения(НовРЛ.Ссылка);
					НовСобытие.ДатаНачала = DeclinedJob.FollowUpDate;
					НовСобытие.ДатаОкончания = DeclinedJob.FollowUpDate + 3600; 
					НовСобытие.ВидСобытия=Перечисления.ВидыСобытий.ТелефонныйЗвонок;
					НовСобытие.ТипСообщения=Перечисления.ТипыСообщений.Исходящее;
					НовСобытие.Приоритет=Перечисления.Важность.Средняя;
					НовСобытие.Состояние=Перечисления.СостоянияСобытий.Запланировано;
					НовСобытие.ДокументОснование=НовРЛ.Ссылка;
					НовСобытие.Содержание = "WA: " + DeclinedJob.Name;
					НовСобытие.Комментарий = DeclinedJob.Comment;
					НовСобытие.Пользователи.Очистить();
					НовСобытие.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст;
					СтрокаПользователь = НовСобытие.Пользователи.Добавить();
					СтрокаПользователь.Пользователь	= Справочники.Пользователи.НайтиПоРеквизиту("Сотрудник",Сотрудник);					
					НовСобытие.Записать();  				
				КонецЕсли;				
				
				Попытка
					Photos = PrintRequest.DeclinedJob.Photos;
				Исключение
			    	Photos = Неопределено;       		
				КонецПопытки; 

				Если Photos <> Неопределено Тогда
					к = 1;
					Для Каждого ЭлМассива Из DeclinedJob.Photos.Photo Цикл
						РегКартинкиИФайлы = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
						РегКартинкиИФайлы.Объект = ЗаказНарядСсылка;
						РегКартинкиИФайлы.Идентификатор = DeclinedJob.Name+Строка(к);
						РегКартинкиИФайлы.ИмяФайла = ЭлМассива.Value;
						РегКартинкиИФайлы.ДатаСохранения = ТекущаяДата();
						РегКартинкиИФайлы.Комментарий = "Фотографии из планшета WA во время кругового осмотра";
						РегКартинкиИФайлы.ДанныеВоВнешнемФайле = Истина;
						РегКартинкиИФайлы.Картинка = Истина;
						РегКартинкиИФайлы.Записать(Истина);
						к=к+1;
					КонецЦикла; 					
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаФотографий Тогда // передача фотографий, сделанных мастером цеха/механиком во время ремонта
		Попытка
			Photos = PrintRequest.Print.Photos;
		Исключение
	    	Photos = Неопределено;       		
		КонецПопытки; 	
		к = 1;
		Если Photos <> Неопределено Тогда
			Для Каждого ЭлМассива Из Photos.Photo Цикл
				РегКартинкиИФайлы = РегистрыСведений.КартинкиИФайлы.СоздатьМенеджерЗаписи();
				РегКартинкиИФайлы.Объект = ЗаказНарядСсылка;
				РегКартинкиИФайлы.Идентификатор = ЭлМассива.Category + Строка(к);           
				РегКартинкиИФайлы.ИмяФайла = ЭлМассива.Value;
				РегКартинкиИФайлы.ДатаСохранения = ТекущаяДата();
				РегКартинкиИФайлы.Комментарий = "Фотографии из планшета WA во время ремонта";
				РегКартинкиИФайлы.ДанныеВоВнешнемФайле = Истина;
				РегКартинкиИФайлы.Картинка = Истина;
				РегКартинкиИФайлы.Записать(Истина);
				к = к + 1;
			КонецЦикла; 
		КонецЕсли;
	                     			
	КонецЕсли;		  	
	
	// формирование и вывод печатных форм
	ДокОбъект = ЗаказНарядСсылка.ПолучитьОбъект();	
	ТабДок = Неопределено;
	
	ИмяФайлаПечатнойФормы = ПолучитьИмяВременногоФайла("pdf");
	Если ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПредварительныйЗН Тогда
		Попытка
			ТабДок = ДокОбъект.ПечатьЕДОСПредварительныйЗаказНаряд(ТабДок);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Функция ПечатьЕДОСПредварительныйЗаказНаряд не найдена или ошибка во время выполнения";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
		Попытка
			ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.РабочийЗН Тогда	
		Попытка
			ТабДок = ДокОбъект.ПечатьЕДОСРабочийЗаказНаряд(ТабДок);
		Исключение
			СтрокаОшибки111 = ОписаниеОшибки();
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Функция ПечатьЕДОСРабочийЗаказНаряд не найдена или ошибка во время выполнения";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
		Попытка
			ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ФинальныйЗН Тогда		
		Попытка
			ТабДок = ДокОбъект.ПечатьЕДОСЗаказНаряд(ТабДок);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Функция ПечатьЕДОСЗаказНаряд не найдена или ошибка во время выполнения";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
		Попытка
			ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.КонтрольКачества Тогда	// выяснить что это за форма у регионалов!	
		ВПФСсылка = Справочники.ВнешниеПечатныеФормы.НайтиПоНаименованию("Лист контроля качества WA");
		Если ЗначениеЗаполнено(ВПФСсылка) Тогда
			ВПФОбъект = ВПФСсылка.ПолучитьОбъект();
			ТабДок = ВПФОбъект.Печать(ДокОбъект);
		Иначе
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не найдена внешняя печатная форма";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецЕсли;
		Попытка
			ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.АктПриемаПередачи Тогда
		//Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"1",ТаблицаОщибок);
		//Возврат Print; 
		ВПФСсылка = Справочники.ВнешниеПечатныеФормы.НайтиПоНаименованию("Хендэ - Акт кругового осмотра WA");
		Если ЗначениеЗаполнено(ВПФСсылка) Тогда
			ВПФОбъект = ВПФСсылка.ПолучитьОбъект();
			ТабДок = ВПФОбъект.Печать(ДокОбъект);
			Если обЗначениеНеЗаполнено(ТабДок) Тогда
				НоваяСтрока = ТаблицаОщибок.Добавить();
				НоваяСтрока.Код = "WA03";
				НоваяСтрока.ТекстОшибки = "Внешняя печатная форма не загружена в базу или файл не указан";
				Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
				Возврат Print; 			
			КонецЕсли;
			
		Иначе
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не найдена внешняя печатная форма";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецЕсли;
		Попытка
			ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		КонецПопытки;
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПодборочныйЛистНаСклад Тогда // перемещение в производство
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПеремещениеТоваровВПроизводство.Ссылка
		               |ИЗ
		               |	Документ.ПеремещениеТоваровВПроизводство КАК ПеремещениеТоваровВПроизводство
		               |ГДЕ
		               |	ПеремещениеТоваровВПроизводство.ДокументОснование = &Ссылка
		               |	И ПеремещениеТоваровВПроизводство.ПометкаУдаления = ЛОЖЬ";
					   
		Запрос.Параметры.Вставить("Ссылка", ЗаказНарядСсылка);
	    Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаОщибок.Добавить();
			НоваяСтрока.Код = "WA03";
			НоваяСтрока.ТекстОшибки = "Не оформлены перемещения товаров в производство!";
			Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
			Возврат Print; 			
		Иначе
			Пока Выборка.Следующий() Цикл
				ПеремещениеОбъект = Выборка.Ссылка.ПолучитьОбъект();     		
				ВПФСсылка = Справочники.ВнешниеПечатныеФормы.НайтиПоНаименованию("Перемещение товаров в производство");
				Если ЗначениеЗаполнено(ВПФСсылка) Тогда
					ВПФОбъект = ВПФСсылка.ПолучитьОбъект();
					ТабДок = ВПФОбъект.Печать(ПеремещениеОбъект);
					Если обЗначениеНеЗаполнено(ТабДок) Тогда
						НоваяСтрока = ТаблицаОщибок.Добавить();
						НоваяСтрока.Код = "WA03";
						НоваяСтрока.ТекстОшибки = "Внешняя печатная форма не загружена в базу или файл не указан";
						Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
						Возврат Print; 			
					КонецЕсли;
					
				Иначе
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "WA03";
					НоваяСтрока.ТекстОшибки = "Не найдена внешняя печатная форма";
					Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
					Возврат Print; 			
				КонецЕсли;
				Попытка
					ТабДок.Записать(ИмяФайлаПечатнойФормы, ТипФайлаТабличногоДокумента.PDF);
				Исключение
					НоваяСтрока = ТаблицаОщибок.Добавить();
					НоваяСтрока.Код = "WA03";
					НоваяСтрока.ТекстОшибки = "Не удалось сохранить макет печатной формы на сервере";
					Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
					Возврат Print; 			
				КонецПопытки;
			КонецЦикла;
		КонецЕсли;    		
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.СогласиеНаОбработкуПерсональныхДанных  Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Распечатать согласие на обработку персональных данных можно только из карточки Контрагента!";
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		Возврат Print; 			
		
	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаДанныхПоНазначеннымСобытиям Тогда
	    Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"1",ТаблицаОщибок);
		Возврат Print; 

	ИначеЕсли ПечатнаяФорма = Перечисления.НазванияПечатныхФорм.ПередачаФотографий Тогда
	    Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"1",ТаблицаОщибок);
		Возврат Print; 		
	КонецЕсли;
	
	ИмяФайлаPostScript = ПолучитьИмяВременногоФайла("ps");
	КодВозврата = 0;
	ИмяФайлаGhostScript = "C:\Program Files\gs\gs9.55.0\bin\gswin64.exe";
	ЗапуститьПриложение(ИмяФайлаGhostScript + " -sDEVICE=pxlcolor -o " + ИмяФайлаPostScript + " " + ИмяФайлаПечатнойФормы, 
						КаталогВременныхФайлов(), Истина, КодВозврата);
	Если КодВозврата <> 0 Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Приложение GhostScript завершилось с ошибкой " + Строка(КодВозврата);
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		Возврат Print; 			
	КонецЕсли;
						
	ИмяПринтера = "";
	КодДилера = PrintRequest.TransactionHeader.DealerID;
	Если КодДилера = "RC294" Тогда
		ИмяПринтера = Константы.waПринтерДляДилераRC294.Получить();
	ИначеЕсли КодДилера = "RC536" Тогда
		ИмяПринтера = Константы.waПринтерДляДилераRC445.Получить();
	КонецЕсли;				
	Если обЗначениеНеЗаполнено(ИмяПринтера) Тогда
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "В настройках параметров 1С не задано имя принтера для " + КодДилера;
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		Возврат Print; 			
	КонецЕсли;
	
	Попытка
		ФТП = Новый FTPСоединение(ИмяПринтера, 21, "anonymous", "anonymous");
		ФТП.Записать(ИмяФайлаPostScript, "WA");	
	Исключение
		НоваяСтрока = ТаблицаОщибок.Добавить();
		НоваяСтрока.Код = "WA03";
		НоваяСтрока.ТекстОшибки = "Не удалось подключитьсч к FTP-серверу " + ИмяПринтера;
		Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"-1",ТаблицаОщибок);
		Возврат Print; 			
	КонецПопытки;
	
    Print = обПолучитьВозвратWAError("http://wa.dms.webservice/PrintRequest",PrintRequest,Print,"1",ТаблицаОщибок);
	Возврат Print; 

КонецФункции
